
Перем Префикс; // Строка - префикс фильтрации переменных среды

#Область Публичное_API

// Устанавливает префикс фильтрации переменных среды
//
// Параметры:
//   ПрефиксФильтра - Строка - префикс
//
//  Возвращаемое значение:
//   НастройкиПровайдераENV - ссылка на текущий объект
//
Функция УстановитьПрефикс(Знач ПрефиксФильтра) Экспорт
	Префикс = ПрефиксФильтра;
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает установленный префикс
//
//  Возвращаемое значение:
//   Строка - текущий префикс
//
Функция ПолучитьПрефикс() Экспорт
	Возврат Префикс;
КонецФункции

#КонецОбласти

Процедура ПриСозданииОбъекта(НачальныйПрефикс = "")
	Префикс = НачальныйПрефикс;
КонецПроцедуры
