
Перем мПараметры; // Соответствие

#Область Публичное_API

// Устанавливает источник параметров
//
// Параметры:
//   ИсточникПараметров - Соответствие - источник параметров
//
// Возвращаемое значение:
//   НастройкиПровайдераСоответствие - ссылка на текущий объект
//
Функция УстановитьПараметры(Знач ИсточникПараметров) Экспорт

	Если ТипЗнч(ИсточникПараметров) <> Тип("Соответствие") Тогда
		ВызватьИсключение
			"Для провайдера параметров Соответствие, источником параметров может быть только соответствие";
	КонецЕсли;

	мПараметры = ИсточникПараметров;
	Возврат ЭтотОбъект;

КонецФункции

// Возвращает установленный источник параметров
//
// Возвращаемое значение:
//   Соответствие - текущий источник параметров
//
Функция ПолучитьПараметры() Экспорт
	Возврат мПараметры;
КонецФункции

#КонецОбласти

Процедура ПриСозданииОбъекта(НачальныеПараметры = Неопределено)

	Если НачальныеПараметры <> Неопределено Тогда
		УстановитьПараметры(НачальныеПараметры);
	Иначе
		мПараметры = Новый Соответствие;
	КонецЕсли;

КонецПроцедуры
