// Файловый провайдер параметров формата YAML.
// Тонкий фасад над БазовымФайловымПровайдером с парсером YAML.

Перем _Ядро; // БазовыйФайловыйПровайдер

#Область ПрограммныйИнтерфейс

// Возвращает приоритет провайдера
//
//  Возвращаемое значение:
//   Число - текущий приоритет провайдера
//
Функция Приоритет() Экспорт
	Возврат _Ядро.Приоритет();
КонецФункции

// Устанавливает приоритет провайдера
//
// Параметры:
//   НовыйПриоритет - Число - приоритет
//
// Возвращаемое значение:
//   Объект.ПровайдерПараметровYAML - ссылка на текущий объект
//
Функция УстановитьПриоритет(Знач НовыйПриоритет) Экспорт
	_Ядро.УстановитьПриоритет(НовыйПриоритет);
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает идентификатор провайдера
//
//  Возвращаемое значение:
//   Строка - текущий идентификатор провайдера
//
Функция Идентификатор() Экспорт
	Возврат _Ядро.Идентификатор();
КонецФункции

// Устанавливает идентификатор провайдера
//
// Параметры:
//   НовыйИдентификатор - Строка - идентификатор
//
// Возвращаемое значение:
//   Объект.ПровайдерПараметровYAML - ссылка на текущий объект
//
Функция УстановитьИдентификатор(Знач НовыйИдентификатор) Экспорт
	_Ядро.УстановитьИдентификатор(НовыйИдентификатор);
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает тип провайдера
//
//  Возвращаемое значение:
//   Строка - текущий тип провайдера
//
Функция ТипПровайдера() Экспорт
	Возврат _Ядро.ТипПровайдера();
КонецФункции

// Возвращает расширения файлов по умолчанию
//
//  Возвращаемое значение:
//   Строка - расширения файлов по умолчанию (yaml yml)
//
Функция РасширенияФайлов() Экспорт
	Возврат _Ядро.РасширенияФайлов();
КонецФункции

// Возвращает объект настроек провайдера
//
//  Возвращаемое значение:
//   НастройкиФайловогоПровайдера - настройки
//
Функция Настройки() Экспорт
	Возврат _Ядро.Настройки();
КонецФункции

// Выполняет чтение параметров для провайдера
//
//  Возвращаемое значение:
//   Соответствие - результат чтения провайдера
//
Функция ПрочитатьПараметры() Экспорт
	Возврат _Ядро.ПрочитатьПараметры();
КонецФункции

// Выполняет чтение и разбор одного файла параметров
//
// Параметры:
//   ПутьКФайлуНастройки - Строка - путь к файлу параметров
//
//  Возвращаемое значение:
//   Соответствие - итоговые параметры
//
Функция Прочитать(Знач ПутьКФайлуНастройки) Экспорт
	Возврат _Ядро.Прочитать(ПутьКФайлуНастройки);
КонецФункции

#КонецОбласти

Процедура ПриСозданииОбъекта()
	_Ядро = Новый БазовыйФайловыйПровайдер(Новый ПарсерПараметровYAML, "yaml", 1, "oscript.lib.configor.yaml");
КонецПроцедуры
