#Использовать logos

Перем Лог;

Перем _Приоритет; // Число
Перем _Идентификатор; // Строка
Перем _Настройки; // НастройкиПровайдераENV

Процедура ПриСозданииОбъекта(ПрефиксПеременныхСреды = "")
	_Приоритет = 2;
	_Идентификатор = "env";
	_Настройки = Новый НастройкиПровайдераENV(ПрефиксПеременныхСреды);
	Лог = Логирование.ПолучитьЛог("oscript.lib.configor.env");
КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Возвращает приоритет провайдера
//
//  Возвращаемое значение:
//   Число - текущий приоритет провайдера
//
Функция Приоритет() Экспорт
	Возврат _Приоритет;
КонецФункции

// Устанавливает приоритет провайдера
//
// Параметры:
//   НовыйПриоритет - Число - приоритет
//
// Возвращаемое значение:
//   Объект.ПровайдерПараметровENV - ссылка на текущий объект
//
Функция УстановитьПриоритет(Знач НовыйПриоритет) Экспорт
	_Приоритет = НовыйПриоритет;
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает идентификатор провайдера
//
//  Возвращаемое значение:
//   Строка - текущий идентификатор провайдера
//
Функция Идентификатор() Экспорт
	Возврат _Идентификатор;
КонецФункции

// Устанавливает идентификатор провайдера
//
// Параметры:
//   НовыйИдентификатор - Строка - идентификатор
//
// Возвращаемое значение:
//   Объект.ПровайдерПараметровENV - ссылка на текущий объект
//
Функция УстановитьИдентификатор(Знач НовыйИдентификатор) Экспорт
	_Идентификатор = НовыйИдентификатор;
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает тип провайдера
//
//  Возвращаемое значение:
//   Строка - текущий тип провайдера
//
Функция ТипПровайдера() Экспорт
	Возврат "env";
КонецФункции

// Возвращает объект настроек провайдера
//
//  Возвращаемое значение:
//   НастройкиПровайдераENV - настройки
//
Функция Настройки() Экспорт
	Возврат _Настройки;
КонецФункции

// Выполняет чтение параметров для провайдера
// Для указания префикса использовать метод Настройки().УстановитьПрефикс(...)
//
//  Возвращаемое значение:
//   Соответствие - результат чтения провайдера
//
Функция ПрочитатьПараметры() Экспорт

	ЭффективныйПрефикс = _Настройки.ПолучитьПрефикс();

	Лог.Отладка("Выполняю чтение параметров переменных среды для префикса <%1>", ЭффективныйПрефикс);

	ПеременныеСреды = ПеременныеСреды();
	ПрочитанныеПараметры = Новый Соответствие;

	Для каждого ПеременнаяСреды Из ПеременныеСреды Цикл

		ПрочитанныеПараметры.Вставить(
			СтрЗаменить(СтрЗаменить(ПеременнаяСреды.Ключ, "_", "."), "..", "_"),
			ПеременнаяСреды.Значение
		);

	КонецЦикла;

	Результат = Новый Соответствие;

	Если ПустаяСтрока(ЭффективныйПрефикс) Тогда
		Результат = ПрочитанныеПараметры;
	Иначе

		Для каждого ПеременнаяСреды Из ПрочитанныеПараметры Цикл

			Если СтрНачинаетсяС(НРег(ПеременнаяСреды.Ключ), НРег(ЭффективныйПрефикс)) Тогда

				Результат.Вставить(
					Прав(ПеременнаяСреды.Ключ, СтрДлина(ПеременнаяСреды.Ключ) - (СтрДлина(ЭффективныйПрефикс) + 1)),
					ПеременнаяСреды.Значение
				);

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти
