#Использовать asserts
#Использовать logos
#Использовать 1connector

Перем Лог;

Перем _Приоритет; // Число
Перем _Идентификатор; // Строка
Перем _Настройки; // НастройкиПровайдераVault

#Область ПрограммныйИнтерфейс

// Возвращает приоритет провайдера
//
//  Возвращаемое значение:
//   Число - текущий приоритет провайдера
//
Функция Приоритет() Экспорт
	Возврат _Приоритет;
КонецФункции

// Устанавливает приоритет провайдера
//
// Параметры:
//   НовыйПриоритет - Число - приоритет
//
// Возвращаемое значение:
//   Объект.ПровайдерПараметровVAULT - ссылка на текущий объект
//
Функция УстановитьПриоритет(Знач НовыйПриоритет) Экспорт
	_Приоритет = НовыйПриоритет;
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает идентификатор провайдера
//
//  Возвращаемое значение:
//   Строка - текущий идентификатор провайдера
//
Функция Идентификатор() Экспорт
	Возврат _Идентификатор;
КонецФункции

// Устанавливает идентификатор провайдера
//
// Параметры:
//   НовыйИдентификатор - Строка - идентификатор
//
// Возвращаемое значение:
//   Объект.ПровайдерПараметровVAULT - ссылка на текущий объект
//
Функция УстановитьИдентификатор(Знач НовыйИдентификатор) Экспорт
	_Идентификатор = НовыйИдентификатор;
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает тип провайдера
//
//  Возвращаемое значение:
//   Строка - текущий тип провайдера
//
Функция ТипПровайдера() Экспорт
	Возврат "vault";
КонецФункции

// Возвращает объект настроек провайдера
//
//  Возвращаемое значение:
//   НастройкиПровайдераVault - настройки
//
Функция Настройки() Экспорт
	Возврат _Настройки;
КонецФункции

// Выполняет чтение параметров для провайдера
//
// Параметры:
//   НастройкиПровайдера - Структура - (устарело) внешние настройки; если заданы
//                          собственные настройки провайдера, используются они
//
//  Возвращаемое значение:
//   Соответствие - результат чтения провайдера
//
Функция ПрочитатьПараметры(Знач НастройкиПровайдера = Неопределено) Экспорт

	ПрочитанныеПараметры = Новый Соответствие;

	// Приоритет у собственных настроек
	Н = _Настройки.ПолучитьНастройки();
	Если НастройкиПровайдера <> Неопределено
		И НЕ ЗначениеЗаполнено(Н.Адрес) Тогда
		Н = НастройкиПровайдера;
	КонецЕсли;

	Адрес = Н.Адрес;
	Токен = Н.Токен;
	Запрос = Н.Запрос;

	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Лог.Отладка("Не указан адрес сервера. Чтение невозможно");
		Возврат ПрочитанныеПараметры;
	КонецЕсли;

	Лог.Отладка("Выполняю чтение данных vault из <%1>/%2", Адрес, Запрос);
	ПрочитанныеПараметры = Прочитать(Адрес, Токен, Запрос);

	Возврат ПрочитанныеПараметры;
КонецФункции

#КонецОбласти

// Выполнить чтение настроек из vault
//
// Параметры:
//   Адрес - Cтрока - URL сервера vault
//   Токен - Cтрока - токен авторизации
//   Запрос - Cтрока - путь  к данным vault
// Возвращаемое значение:
//   Соответствие - итоговые параметры
//
Функция Прочитать(Знач Адрес, Знач Токен, Знач Запрос)

	Настройки = Новый Соответствие;
	
	URL = СтрШаблон("%1/%2", СтрУбратьСКонца(Адрес, "/"), Запрос);
	Заголовки = Новый Соответствие;
		
	Если ЗначениеЗаполнено(Токен) Тогда
		Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));
	КонецЕсли;

	ДопПараметры = Новый Структура("Заголовки", Заголовки);
	
	Попытка

		Ответ = КоннекторHTTP.Get(URL, , ДопПараметры);
		ВолтОтветил = ВолтОтветил(Ответ);
		Если Не ВолтОтветил Тогда
			Лог.Отладка("Ошибка получения данных из vault:
			|%1", КодыСостоянияHTTP.Представление(Ответ.КодСостояния));
		КонецЕсли;

		ДесериализованныйОтвет = Ответ.Json();
		Ошибки = ДесериализованныйОтвет.Получить("errors");
		Если Не Ошибки = Неопределено Тогда
			Для Каждого Ошибка Из Ошибки Цикл
				Лог.Отладка(Ошибка);
			КонецЦикла;
		КонецЕсли;

		Настройки = ?(ВолтОтветил, ДесериализованныйОтвет["data"], Новый Соответствие);

		Лог.Отладка("Итоговые параметры:");
		ПоказатьПараметрыВРежимеОтладки(Настройки);

	Исключение

		Лог.Отладка("Ошибка чтения настроек vault из %1
		|%2", URL, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		ВызватьИсключение;

	КонецПопытки;

	Возврат Настройки;
КонецФункции

Функция ВолтОтветил(Знач Ответ)

	ХорошиеКоды = Новый Массив;
	ХорошиеКоды.Добавить(200);
	ХорошиеКоды.Добавить(204);

	Возврат Не ХорошиеКоды.Найти(Ответ.КодСостояния) = Неопределено;
КонецФункции

Процедура ПоказатьПараметрыВРежимеОтладки(ЗначенияПараметров)

	ПроцессорВывода = Новый ВыводВРежимеОтладки(Лог);
	ПроцессорВывода.ПоказатьНастройкиВРежимеОтладки(ЗначенияПараметров);

КонецПроцедуры

Функция СтрУбратьСКонца(Знач Стр, Знач СтрПоиска)
	Возврат ?(СтрЗаканчиваетсяНа(Стр, СтрПоиска), Лев(Стр, СтрДлина(Стр) - СтрДлина(СтрПоиска)), Стр);
КонецФункции

Лог = Логирование.ПолучитьЛог("oscript.lib.configor.vault");

_Приоритет = 1;
_Идентификатор = "vault";
_Настройки = Новый НастройкиПровайдераVault;
