#Использовать logos

Перем Лог;
Перем мПараметры;

Перем _Приоритет; // Число
Перем _Идентификатор; // Строка

Процедура ПриСозданииОбъекта(Параметры = Неопределено)

	_Приоритет = 3;
	_Идентификатор = "map";
	Лог = Логирование.ПолучитьЛог("oscript.lib.configor.map");

	Если Параметры = Неопределено Тогда
		мПараметры = Новый Соответствие;
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Параметры) <> Тип("Соответствие") Тогда
		ВызватьИсключение
			"Для провайдера параметров Соответствие, источником параметров может быть только соответствие";
	КонецЕсли;

	мПараметры = Параметры;

КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Возвращает приоритет провайдера
//
//  Возвращаемое значение:
//   Число - текущий приоритет провайдера
//
Функция Приоритет() Экспорт
	Возврат _Приоритет;
КонецФункции

// Устанавливает приоритет провайдера
//
// Параметры:
//   НовыйПриоритет - Число - приоритет
//
// Возвращаемое значение:
//   Объект.ПровайдерПараметровСоответствие - ссылка на текущий объект
//
Функция УстановитьПриоритет(Знач НовыйПриоритет) Экспорт
	_Приоритет = НовыйПриоритет;
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает идентификатор провайдера
//
//  Возвращаемое значение:
//   Строка - текущий идентификатор провайдера
//
Функция Идентификатор() Экспорт
	Возврат _Идентификатор;
КонецФункции

// Устанавливает идентификатор провайдера
//
// Параметры:
//   НовыйИдентификатор - Строка - идентификатор
//
// Возвращаемое значение:
//   Объект.ПровайдерПараметровСоответствие - ссылка на текущий объект
//
Функция УстановитьИдентификатор(Знач НовыйИдентификатор) Экспорт
	_Идентификатор = НовыйИдентификатор;
	Возврат ЭтотОбъект;
КонецФункции

// Возвращает тип провайдера
//
//  Возвращаемое значение:
//   Строка - текущий тип провайдера
//
Функция ТипПровайдера() Экспорт
	Возврат "memory";
КонецФункции

// Устанавливает источник параметров
//
// Параметры:
//   ИсточникПараметров - Соответствие - источник параметров
//
// Возвращаемое значение:
//   Объект.ПровайдерПараметровСоответствие - ссылка на текущий объект
//
Функция УстановитьПараметры(Знач ИсточникПараметров) Экспорт

	Если ТипЗнч(ИсточникПараметров) <> Тип("Соответствие") Тогда
		ВызватьИсключение
			"Для провайдера параметров Соответствие, источником параметров может быть только соответствие";
	КонецЕсли;

	мПараметры = ИсточникПараметров;
	Возврат ЭтотОбъект;

КонецФункции

// Выполняет чтение параметров для провайдера
//
// Параметры:
//   НастройкиПровайдера - Структура - игнорируется
//
//  Возвращаемое значение:
//   Соответствие - результат чтения провайдера
//
Функция ПрочитатьПараметры(НастройкиПровайдера = Неопределено) Экспорт

	Лог.Отладка("Считываю параметры из соответствия");

	Возврат мПараметры;

КонецФункции

Функция Настройки() Экспорт
	Возврат Неопределено;
КонецФункции

#КонецОбласти
